Masmiseim36/nxpSDK/middleware/mcu-boot/tools/tools/KinetisFlashTool/KinetisFlashTool/KinetisFlashToolDlg.cpp
/*
 * Copyright (c) 2013-2015 Freescale Semiconductor, Inc.
 * All rights reserved.
 * 
 * SPDX-License-Identifier: BSD-3-Clause
 */

// KinetisFlashToolDlg.cpp : implementation file
//

#include "stdafx.h"
#include "KinetisFlashTool.h"
#include "KinetisFlashToolDlg.h"
#include "afxdialogex.h"
#include "SerialList.h"
#include "HistoryData.h"
#include "Bootloader.h"
#include "utility.h"
#include <WinUser.h>
#include <Dbt.h>
#include <cfgmgr32.h>

#ifdef _DEBUG
#define new DEBUG_NEW
#endif

CKinetisFlashToolDlg *g_pMainDlg;

// CAboutDlg dialog used for App About
class CAboutDlg : public CDialogEx
{
public:
    //! \brief Generated standard constructor.
    CAboutDlg();

    // Dialog Data
    enum
    {
        IDD = IDD_ABOUTBOX
    };

protected:
    virtual void DoDataExchange(CDataExchange *pDX); // DDX/DDV support

    // Implementation
protected:
    DECLARE_MESSAGE_MAP()
};

CAboutDlg::CAboutDlg()
    : CDialogEx(CAboutDlg::IDD)
{
}

void CAboutDlg::DoDataExchange(CDataExchange *pDX)
{
    CDialogEx::DoDataExchange(pDX);
}

BEGIN_MESSAGE_MAP(CAboutDlg, CDialogEx)
END_MESSAGE_MAP()

// CKinetisFlashToolDlg dialog

IMPLEMENT_DYNAMIC(CKinetisFlashToolDlg, CDialogEx);
// See CKinetisFlashToolDlg.h for documentation of this method.
CKinetisFlashToolDlg::CKinetisFlashToolDlg(CWnd *pParent /*=NULL*/)
    : CDialogEx(CKinetisFlashToolDlg::IDD, pParent)
    , m_log(_T(""))
    , m_bootloaderVersion(_T(""))
    , m_protoclVersion(_T(""))
    , m_securityState(_T(""))
    , m_flashSize(_T(""))
    , m_ramSize(_T(""))
    , m_rsvRgnFlashStart(_T(""))
    , m_rsvRgnFlashEnd(_T(""))
    , m_rsvRgnRamStart(_T(""))
    , m_rsvRgnRamEnd(_T(""))
    , m_devNotify(NULL)
{
    m_hIcon = AfxGetApp()->LoadIcon(IDI_FREESCALE);
}

// See CKinetisFlashToolDlg.h for documentation of this method.
CKinetisFlashToolDlg::~CKinetisFlashToolDlg()
{
    // If there is an automation proxy for this dialog, set
    //  its back pointer to this dialog to NULL, so it knows
    //  the dialog has been deleted.
    // if (m_pAutoProxy != NULL)
    //	m_pAutoProxy->m_pDialog = NULL;
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::DoDataExchange(CDataExchange *pDX)
{
    CDialogEx::DoDataExchange(pDX);
    DDX_Control(pDX, IDC_TAB_FUNC, m_tabFunc);
    DDX_Control(pDX, IDC_COMBO_PORT_VID, m_comboPortOrVID);
    DDX_Control(pDX, IDC_COMBO_BAUD_PID, m_comboBaudOrPID);
    DDX_Text(pDX, IDC_EDIT_LOG, m_log);
    DDX_Control(pDX, IDC_EDIT_LOG, m_logCtrl);
    DDX_Text(pDX, IDC_STATIC_BOOTLLOADER_VERSION, m_bootloaderVersion);
    DDX_Text(pDX, IDC_STATIC_SERIAL_VERSION, m_protoclVersion);
    DDX_Text(pDX, IDC_STATIC_SECURITY_STATE, m_securityState);
    DDX_Text(pDX, IDC_STATIC_FLASH_SIZE, m_flashSize);
    DDX_Text(pDX, IDC_STATIC_RAM_SIZE, m_ramSize);
    DDX_Text(pDX, IDC_STATIC_RESERVED_FLASH_START, m_rsvRgnFlashStart);
    DDX_Text(pDX, IDC_STATIC_RESERVED_FLASH_END, m_rsvRgnFlashEnd);
    DDX_Text(pDX, IDC_STATIC_RESERVED_RAM_START, m_rsvRgnRamStart);
    DDX_Text(pDX, IDC_STATIC_RESERVED_RAM_END, m_rsvRgnRamEnd);
}

BEGIN_MESSAGE_MAP(CKinetisFlashToolDlg, CDialogEx)
ON_WM_SYSCOMMAND()
ON_WM_CLOSE()
ON_WM_PAINT()
ON_WM_QUERYDRAGICON()
ON_BN_CLICKED(IDC_RADIO_UART, &CKinetisFlashToolDlg::OnBnClickedRadio)
ON_BN_CLICKED(IDC_RADIO_USBHID, &CKinetisFlashToolDlg::OnBnClickedRadio)
ON_NOTIFY(TCN_SELCHANGE, IDC_TAB_FUNC, &CKinetisFlashToolDlg::OnTcnSelchangeTabFunc)
ON_CBN_SELCHANGE(IDC_COMBO_PORT_VID, &CKinetisFlashToolDlg::OnCbnSelchangeComboPortVid)
ON_CBN_SELCHANGE(IDC_COMBO_BAUD_PID, &CKinetisFlashToolDlg::OnCbnSelchangeComboBaudPid)
ON_CBN_KILLFOCUS(IDC_COMBO_PORT_VID, &CKinetisFlashToolDlg::OnKillfocusComboPortVid)
ON_CBN_KILLFOCUS(IDC_COMBO_BAUD_PID, &CKinetisFlashToolDlg::OnKillfocusComboBaudPid)
ON_BN_CLICKED(IDC_BUTTON_CNT_RESET, &CKinetisFlashToolDlg::OnClickedButtonCntReset)
ON_WM_TIMER()
ON_WM_DEVICECHANGE()
// User defined message
ON_MESSAGE(USER_MS_UPDATA_LOG, &CKinetisFlashToolDlg::OnUpdateLog)
ON_MESSAGE(USER_MS_CONNECTION_CHANGE, &CKinetisFlashToolDlg::OnChangeConnection)
ON_MESSAGE(USER_MS_UPDATA_STATUS, &CKinetisFlashToolDlg::OnUpdateStatus)
END_MESSAGE_MAP()

// CKinetisFlashToolDlg message handlers

// See CKinetisFlashToolDlg.h for documentation of this method.
BOOL CKinetisFlashToolDlg::OnInitDialog()
{
    CDialogEx::OnInitDialog();

    // Add "About..." menu item to system menu.

    // IDM_ABOUTBOX must be in the system command range.
    ASSERT((IDM_ABOUTBOX & 0xFFF0) == IDM_ABOUTBOX);
    ASSERT(IDM_ABOUTBOX < 0xF000);

    CMenu *pSysMenu = GetSystemMenu(FALSE);
    if (pSysMenu != NULL)
    {
        BOOL bNameValid;
        CString strAboutMenu;
        bNameValid = strAboutMenu.LoadString(IDS_ABOUTBOX);
        ASSERT(bNameValid);
        if (!strAboutMenu.IsEmpty())
        {
            pSysMenu->AppendMenu(MF_SEPARATOR);
            pSysMenu->AppendMenu(MF_STRING, IDM_ABOUTBOX, strAboutMenu);
        }
    }

    // Set the icon for this dialog.  The framework does this automatically
    //  when the application's main window is not a dialog
    SetIcon(m_hIcon, TRUE);  // Set big icon
    SetIcon(m_hIcon, FALSE); // Set small icon

    // ShowWindow(SW_MAXIMIZE);

    // TODO: Add extra initialization here
    g_pMainDlg = this;

    // Init COM port and baudrate list
    RefreshComPortList();
    RefreshBaudrateList();
    // Init port button. uart is selected as default
    ((CButton *)GetDlgItem(IDC_RADIO_UART))->SetCheck(true);
    ((CButton *)GetDlgItem(IDC_RADIO_USBHID))->SetCheck(false);

    ((CEdit *)GetDlgItem(IDC_STATIC_PORT_VID))->SetWindowTextW(_T("Port:"));
    ((CEdit *)GetDlgItem(IDC_STATIC_BAUD_PID))->SetWindowTextW(_T("Baud:"));

    // Register usb device notification.
    RegisterUsbDeviceInterface();

    // Init tab page.
    // Add tab pages
    m_tabFunc.InsertItem(0, _T("Update"));
    m_tabFunc.InsertItem(1, _T("Flash Utilities"));
    m_tabFunc.InsertItem(2, _T("BCA Utilities"));
    // m_tabFunc.InsertItem(3, _T("IFR Utilities"));
    // m_tabFunc.InsertItem(4, _T("Blhost Utilities"));
    // Get tab page's size, and calculate child page's size.
    CRect rc;
    m_tabFunc.GetClientRect(&rc);
    rc.top += 22; // add 20 more to discover the tab title.
    rc.bottom -= 2;
    rc.left += 2;
    rc.right -= 2;
    // Setup update page
    m_updateDlg.Create(IDD_DIALOG_UPDATE, GetDlgItem(IDC_TAB_FUNC)); // create update page
    m_updateDlg.SetWindowPos(NULL, rc.left, rc.top, rc.right - rc.left, rc.bottom - rc.top,
                             SWP_SHOWWINDOW); // set window position
    m_updateDlg.ShowWindow(true);
    // Setup Flash utilities page
    m_flashDlg.Create(IDD_DIALOG_FLASH, GetDlgItem(IDC_TAB_FUNC)); // create config page
    m_flashDlg.SetWindowPos(NULL, rc.left, rc.top, rc.right - rc.left, rc.bottom - rc.top,
                            SWP_SHOWWINDOW); // set window position
    m_flashDlg.ShowWindow(false);
    // Setup BCA utilities page
    m_bootloaderConfigDLg.Create(IDD_DIALOG_CONFIG, GetDlgItem(IDC_TAB_FUNC)); // create config page
    m_bootloaderConfigDLg.SetWindowPos(NULL, rc.left, rc.top, rc.right - rc.left, rc.bottom - rc.top,
                                       SWP_SHOWWINDOW); // set window position
    m_bootloaderConfigDLg.ShowWindow(false);

