Masmiseim36/nxpSDK/middleware/mcu-boot/tools/tools/KinetisFlashTool/KinetisFlashTool/KinetisFlashToolDlg.cpp
    m_tabFunc.SetCurSel(0); // set default tab page to page 0(Update page)

    return TRUE; // return TRUE  unless you set the focus to a control
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnSysCommand(UINT nID, LPARAM lParam)
{
    if ((nID & 0xFFF0) == IDM_ABOUTBOX)
    {
        CAboutDlg dlgAbout;
        dlgAbout.DoModal();
    }
    else
    {
        CDialogEx::OnSysCommand(nID, lParam);
    }
}

// If you add a minimize button to your dialog, you will need the code below
//  to draw the icon.  For MFC applications using the document/view model,
//  this is automatically done for you by the framework.

void CKinetisFlashToolDlg::OnPaint()
{
    if (IsIconic())
    {
        CPaintDC dc(this); // device context for painting

        SendMessage(WM_ICONERASEBKGND, reinterpret_cast<WPARAM>(dc.GetSafeHdc()), 0);

        // Center icon in client rectangle
        int cxIcon = GetSystemMetrics(SM_CXICON);
        int cyIcon = GetSystemMetrics(SM_CYICON);
        CRect rect;
        GetClientRect(&rect);
        int x = (rect.Width() - cxIcon + 1) / 2;
        int y = (rect.Height() - cyIcon + 1) / 2;

        // Draw the icon
        dc.DrawIcon(x, y, m_hIcon);
    }
    else
    {
        CDialogEx::OnPaint();
    }
}

// The system calls this function to obtain the cursor to display while the user
// drags
//  the minimized window.
HCURSOR CKinetisFlashToolDlg::OnQueryDragIcon()
{
    return static_cast<HCURSOR>(m_hIcon);
}

// Automation servers should not exit when a user closes the UI
//  if a controller still holds on to one of its objects.  These
//  message handlers make sure that if the proxy is still in use,
//  then the UI is hidden but the dialog remains around if it
//  is dismissed.

void CKinetisFlashToolDlg::OnClose()
{
    uint32_t address = 0;
    if (cstringtoui(m_updateDlg.m_address, address))
    {
        g_pHistoryData->SetImageAddress(address);
    }
    g_pHistoryData->SetBackdoorKey(m_updateDlg.m_backdoorKey);

    UnregisterDeviceNotification(m_devNotify);
    /*
    // Reset command will be sent when bootloader thread exits, not here.
    if (g_pBootloader->m_isConneted)
    {
        Reset();
    }*/
    if (CanExit())
        CDialogEx::OnClose();
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnOK()
{
    // if (CanExit())
    //    CDialogEx::OnOK();
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnCancel()
{
    if (CanExit())
        CDialogEx::OnCancel();
}

// See CKinetisFlashToolDlg.h for documentation of this method.
BOOL CKinetisFlashToolDlg::CanExit()
{
    // If the proxy object is still around, then the automation
    //  controller is still holding on to this application.  Leave
    //  the dialog around, but hide its UI.
    // if (m_pAutoProxy != NULL)
    //{
    //    ShowWindow(SW_HIDE);
    //    return FALSE;
    //}

    return TRUE;
}

void CKinetisFlashToolDlg::RegisterUsbDeviceInterface()
{
    /* The DBT_DEVICEARRIVAL and DBT_DEVICEREMOVECOMPLETE events are automatically broadcast
    * to all top-level windows for port devices. Therefore, it is not necessary to call
    * RegisterDeviceNotification for ports.
    */
    DEV_BROADCAST_DEVICEINTERFACE notificationFilter;
    ZeroMemory(&notificationFilter, sizeof(DEV_BROADCAST_DEVICEINTERFACE));
    notificationFilter.dbcc_size = sizeof(DEV_BROADCAST_DEVICEINTERFACE);
    notificationFilter.dbcc_devicetype = DBT_DEVTYP_DEVICEINTERFACE;
    notificationFilter.dbcc_classguid = GUID_DEVINTERFACE_USB_DEVICE;

    m_devNotify = RegisterDeviceNotification(this->GetSafeHwnd(), &notificationFilter, DEVICE_NOTIFY_WINDOW_HANDLE);
    if (m_devNotify == NULL)
    {
        AppendLog(_T("Error: Failed to register COM port device notification"));
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::RefreshComPortList()
{
    m_comboPortOrVID.ResetContent(); // Clear the content in the combox

    // List all
    for (size_t i = 0; i < g_pAllComDevices->GetDeviceCount(); i++)
    {
        m_comboPortOrVID.AddString(g_pAllComDevices->GetDevice(i).GetString());
    }

    if (m_comboPortOrVID.GetCount() == 0)
    {
        AppendLog(_T("Cannot find a COM port!"));
    }
    else
    {
        m_comboPortOrVID.SetCurSel(g_pHistoryData->GetCurrentDevice());
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::RefreshBaudrateList()
{
    m_comboBaudOrPID.ResetContent(); // Clear the content in the combox

    // List all
    for (size_t i = 0; i < g_pHistoryData->GetBaudRateCount(); i++)
    {
        m_comboBaudOrPID.AddString(format_cstring(_T("%d"), g_pHistoryData->GetBaudRate(i)));
    }
    m_comboBaudOrPID.SetCurSel(g_pHistoryData->GetCurrentBaudRate());
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::RefreshPidList()
{
    m_comboBaudOrPID.ResetContent(); // Clear the content in the combox

    // List all
    for (size_t i = 0; i < g_pHistoryData->GetPidCount(); i++)
    {
        m_comboBaudOrPID.AddString(format_cstring(_T("0x%04X"), g_pHistoryData->GetPid(i)));
    }
    m_comboBaudOrPID.SetCurSel(0);
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::RefreshVidList()
{
    m_comboPortOrVID.ResetContent(); // Clear the content in the combox

    // List all
    for (size_t i = 0; i < g_pHistoryData->GetVidCount(); i++)
    {
        m_comboPortOrVID.AddString(format_cstring(_T("0x%04X"), g_pHistoryData->GetVid(i)));
    }
    m_comboPortOrVID.SetCurSel(0);
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::AppendLog(CString log)
{
    m_log.Append(log);
    m_log.Append(_T("\r\n"));
    UpdateData(false);
    ::PostMessage(m_logCtrl.m_hWnd, WM_VSCROLL, SB_BOTTOM, 0); // Keep Log page always shows the bottom of the log.
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::GetPeripheralConfig(blfwkdll::Updater::PeripheralConfig *config)
{
    CString strW;
    // TODO: Add your control notification handler code here
    if (((CButton *)GetDlgItem(IDC_RADIO_UART))->GetCheck() == BST_CHECKED)
    {
        config->peripheralType = blfwkdll::Updater::HOST_PERIPHERAL_TYPE_TAG::kHostPeripheralType_UART;

        m_comboPortOrVID.GetWindowTextW(strW);
        CStringA strA(strW.GetBuffer());
        strW.ReleaseBuffer(); // Change UCHAR string to CHAR string by these three
                              // steps.
        config->comPortName = strA.GetBuffer();
        strA.ReleaseBuffer();

        m_comboBaudOrPID.GetWindowTextW(strW);
        int32_t speed;
        if (!cstringtoi(strW, speed))
        {
            AppendLog(_T("Error: Invalid Baudrate.(") + strW + _T(")"));
            return;
        }
        config->comPortSpeed = speed;
    }
    else if (((CButton *)GetDlgItem(IDC_RADIO_USBHID))->GetCheck() == BST_CHECKED)
    {
        uint32_t id;

        config->peripheralType = blfwkdll::Updater::HOST_PERIPHERAL_TYPE_TAG::kHostPeripheralType_USB_HID;

        m_comboPortOrVID.GetWindowTextW(strW);
        if (!cstringtoui(strW, id))
        {
            AppendLog(_T("Error: Invalid VID.(") + strW + _T(")"));
            return;
        }
        config->usbHidVid = id & 0xFFFF;

        m_comboBaudOrPID.GetWindowTextW(strW);
        if (!cstringtoui(strW, id))
        {
            AppendLog(_T("Error: Invalid PID.(") + strW + _T(")"));
            return;
        }
        config->usbHidPid = id & 0xFFFF;
    }
    config->ping = true;
    config->packetTimeoutMs = 5000;
}

