Masmiseim36/nxpSDK/middleware/mcu-boot/tools/tools/KinetisFlashTool/KinetisFlashTool/KinetisFlashToolDlg.cpp
void CKinetisFlashToolDlg::Connect(void)
{
    blfwkdll::Updater::PeripheralConfig config;
    GetPeripheralConfig(&config);
    g_pBootloader->Connect(&config);
    // SetTimer(1, 1000, NULL);
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::Reset(void)
{
    // KillTimer(1);
    g_pBootloader->Reset();
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnBnClickedRadio()
{
    // TODO: Add your control notification handler code here
    KillTimer(1); // Peripheral configuration is changed, stop the ping timer.
    if (g_pBootloader->m_isConneted)
    {
        Reset();
    }

    if (((CButton *)GetDlgItem(IDC_RADIO_UART))->GetCheck() == BST_CHECKED)
    {
        ((CEdit *)GetDlgItem(IDC_STATIC_PORT_VID))->SetWindowTextW(_T("Port:"));
        ((CEdit *)GetDlgItem(IDC_STATIC_BAUD_PID))->SetWindowTextW(_T("Baud:"));
        RefreshComPortList();
        RefreshBaudrateList();
    }
    else if (((CButton *)GetDlgItem(IDC_RADIO_USBHID))->GetCheck() == BST_CHECKED)
    {
        ((CEdit *)GetDlgItem(IDC_STATIC_PORT_VID))->SetWindowTextW(_T("VID:"));
        ((CEdit *)GetDlgItem(IDC_STATIC_BAUD_PID))->SetWindowTextW(_T("PID:"));
        RefreshPidList();
        RefreshVidList();
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnCbnSelchangeComboPortVid()
{
    // TODO: Add your control notification handler code here
    KillTimer(1); // Peripheral configuration is changed, stop the ping timer.
    if (g_pBootloader->m_isConneted)
    {
        Reset();
    }

    if (((CButton *)GetDlgItem(IDC_RADIO_UART))->GetCheck() == BST_CHECKED)
    {
        g_pHistoryData->SetCurrentDevice(m_comboPortOrVID.GetCurSel());
    }
    else if (((CButton *)GetDlgItem(IDC_RADIO_USBHID))->GetCheck() == BST_CHECKED)
    {
        g_pHistoryData->BubbleSelectedVid(m_comboPortOrVID.GetCurSel());
        RefreshVidList();
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnCbnSelchangeComboBaudPid()
{
    // TODO: Add your control notification handler code here
    KillTimer(1); // Peripheral configuration is changed, stop the ping timer.
    if (g_pBootloader->m_isConneted)
    {
        Reset();
    }

    if (((CButton *)GetDlgItem(IDC_RADIO_UART))->GetCheck() == BST_CHECKED)
    {
        g_pHistoryData->SetCurrentBaudRate(m_comboBaudOrPID.GetCurSel());
    }
    else if (((CButton *)GetDlgItem(IDC_RADIO_USBHID))->GetCheck() == BST_CHECKED)
    {
        g_pHistoryData->BubbleSelectedPid(m_comboBaudOrPID.GetCurSel());
        RefreshVidList();
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnKillfocusComboPortVid()
{
    if (m_comboPortOrVID.GetCurSel() >= 0)
    {
        // If no change in the textbox, then return;
        return;
    }

    KillTimer(1); // Peripheral configuration is changed, stop the ping timer.
    if (g_pBootloader->m_isConneted)
    {
        Reset();
    }

    CString text;
    m_comboPortOrVID.GetWindowTextW(text);
    if (((CButton *)GetDlgItem(IDC_RADIO_UART))->GetCheck() == BST_CHECKED)
    {
        // Find if there is the same COM port in the device list.
        for (size_t i = 0; i < g_pAllComDevices->GetDeviceCount(); i++)
        {
            if (text.CompareNoCase(g_pAllComDevices->GetDevice(i).GetString()) == 0)
            {
                // If yes, then set it as current selected.
                g_pHistoryData->SetCurrentDevice(i);
            }
        }
        RefreshComPortList();
    }
    else if (((CButton *)GetDlgItem(IDC_RADIO_USBHID))->GetCheck() == BST_CHECKED)
    {
        uint32_t intVid;
        if (!cstringtoui(text, intVid))
        {
            AppendLog(_T("Error: Invalid VID.(") + text + _T(")"));
        }
        else
        {
            g_pHistoryData->InsertVid(static_cast<uint16_t>(intVid));
        }
        RefreshVidList();
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnKillfocusComboBaudPid()
{
    if (m_comboBaudOrPID.GetCurSel() >= 0)
    {
        // If no change in the textbox, then return;
        return;
    }

    KillTimer(1); // Peripheral configuration is changed, stop the ping timer.
    if (g_pBootloader->m_isConneted)
    {
        Reset();
    }

    CString text;
    m_comboBaudOrPID.GetWindowTextW(text);
    if (((CButton *)GetDlgItem(IDC_RADIO_UART))->GetCheck() == BST_CHECKED)
    {
        int32_t intBaud;
        if (!cstringtoi(text, intBaud))
        {
            AppendLog(_T("Error: Invalid Baud Rate.(") + text + _T(")"));
        }
        else
        {
            g_pHistoryData->InsertBaudRate(intBaud);
        }
        RefreshBaudrateList();
    }
    else if (((CButton *)GetDlgItem(IDC_RADIO_USBHID))->GetCheck() == BST_CHECKED)
    {
        uint32_t intPid;
        if (!cstringtoui(text, intPid))
        {
            AppendLog(_T("Error: Invalid PID.(") + text + _T(")"));
        }
        else
        {
            g_pHistoryData->InsertPid(static_cast<uint16_t>(intPid));
        }
        RefreshPidList();
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnClickedButtonCntReset()
{
    if (!g_pBootloader->m_isConneted)
    {
        Connect();
        SetTimer(1, 1000, NULL);
    }
    else
    {
        KillTimer(1);
        Reset();
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnTcnSelchangeTabFunc(NMHDR *pNMHDR, LRESULT *pResult)
{
    // TODO: Add your control notification handler code here
    *pResult = 0;
    switch (m_tabFunc.GetCurSel())
    {
        case 0:
            m_updateDlg.ShowWindow(true);
            m_flashDlg.ShowWindow(false);
            m_bootloaderConfigDLg.ShowWindow(false);
            break;
        case 1:
            m_updateDlg.ShowWindow(false);
            m_flashDlg.ShowWindow(true);
            m_bootloaderConfigDLg.ShowWindow(false);
            break;
        case 2:
            m_updateDlg.ShowWindow(false);
            m_flashDlg.ShowWindow(false);
            m_bootloaderConfigDLg.ShowWindow(true);
            break;
        /*
        case 3:
            m_updateDlg.ShowWindow(false);
            m_flashDlg.ShowWindow(false);
            m_bootloaderConfigDLg.ShowWindow(false);
            break;
        case 4:
            m_updateDlg.ShowWindow(false);
            m_flashDlg.ShowWindow(false);
            m_bootloaderConfigDLg.ShowWindow(false);
            break;
        */
        default:
            break;
    }
}

// See CKinetisFlashToolDlg.h for documentation of this method.
void CKinetisFlashToolDlg::OnTimer(UINT_PTR nIDEvent)
{
    // TODO: Add your control notification handler code here

    g_pBootloader->Ping();

    CDialogEx::OnTimer(nIDEvent);
}

BOOL CKinetisFlashToolDlg::OnDeviceChange(UINT nEventType, DWORD_PTR dwData)
{
#ifdef _DEBUG
    AppendLog(_T("Device Change Event(") + format_cstring(_T("nEventType = %#x"), nEventType) + _T(")"));
#endif

    PDEV_BROADCAST_HDR pHdr = (PDEV_BROADCAST_HDR)dwData;
    switch (nEventType)
    {
        case DBT_DEVICEARRIVAL:
        case DBT_DEVICEREMOVECOMPLETE:
        {
#ifdef _DEBUG
            AppendLog(_T("Device Change Event(") + format_cstring(_T("devicetype = %#x"), pHdr->dbch_devicetype) +
                      _T(")"));
#endif
            if (pHdr->dbch_devicetype == DBT_DEVTYP_PORT)
            {
#ifdef _DEBUG
                AppendLog(_T("Device Change Event(") +
                          format_cstring(_T("dbcp_name = %s"), ((PDEV_BROADCAST_PORT)pHdr)->dbcp_name) + _T(")"));
#endif
                // Backup previous selected device.
                SerialDevice preDev;
                if (g_pHistoryData->GetCurrentDevice() >= 0)
                {
                    preDev = g_pAllComDevices->GetDevice(g_pHistoryData->GetCurrentDevice());
                }

                g_pAllComDevices->ScanSerialDevices(); // Rescan the serial com devices.

