Masmiseim36/nxpSDK/middleware/mcu-boot/tools/tools/KinetisFlashTool/KinetisFlashTool/KinetisFlashToolDlg.cpp
                // If currently no device is selected, select the new device.
                if ((g_pHistoryData->GetCurrentDevice() < 0) && (nEventType == DBT_DEVICEARRIVAL))
                {
                    g_pHistoryData->SetCurrentDevice(
                        g_pAllComDevices->FindSerialDevice(((PDEV_BROADCAST_PORT)pHdr)->dbcp_name));
                }
                else if (g_pHistoryData->GetCurrentDevice() >= 0)
                {
                    g_pHistoryData->SetCurrentDevice(g_pAllComDevices->FindSerialDevice(preDev));
                }
                if (((CButton *)GetDlgItem(IDC_RADIO_UART))->GetCheck() == BST_CHECKED)
                {
                    RefreshComPortList();
                }
            }
            /* For OpenSDA CDC device, DBT_DEVTYP_PORT event will not be broadcasted.
             * Use DBT_DEVTYP_DEVICEINTERFACE event to handle the changes.
             */
            else if (pHdr->dbch_devicetype == DBT_DEVTYP_DEVICEINTERFACE)
            {
#ifdef _DEBUG
                AppendLog(_T("Device Change Event(") +
                          format_cstring(_T("dbcc_name = %s"), ((PDEV_BROADCAST_DEVICEINTERFACE)pHdr)->dbcc_name) +
                          _T(")"));
#endif
                CString devPath = ((PDEV_BROADCAST_DEVICEINTERFACE)pHdr)->dbcc_name;
                // Check whether the event is trigged by OpenSDA device.
                // Only handle OpenSDA device, others will be handled by DBT_DEVTYP_PORT.
                if (devPath.Find(format_cstring(_T("VID_%04x&PID_%04x"), 0x1357, 0x0089)) != -1)
                {
                    // Backup previous selected device.
                    SerialDevice preDev;
                    if (g_pHistoryData->GetCurrentDevice() >= 0)
                    {
                        preDev = g_pAllComDevices->GetDevice(g_pHistoryData->GetCurrentDevice());
                    }

                    Sleep(500);                            // Wait for Windows Registry refresh
                    g_pAllComDevices->ScanSerialDevices(); // Rescan the serial com devices.
                    // If currently no device is selected, select the new device
                    if ((g_pHistoryData->GetCurrentDevice() < 0) && (nEventType == DBT_DEVICEARRIVAL))
                    {
                        HDEVINFO devInfo = SetupDiGetClassDevsW(&GUID_DEVINTERFACE_USB_DEVICE, NULL, 0,
                                                                DIGCF_DEVICEINTERFACE | DIGCF_PRESENT);

                        CString devId = devPath.Left(devPath.ReverseFind(_T('#')));
                        devId = devId.Right(devId.GetLength() - devId.Find(_T("USB")));
                        devId.Replace(_T('#'), _T('\\'));

                        SP_DEVINFO_DATA devInfoData;
                        ZeroMemory(&devInfoData, sizeof(SP_DEVINFO_DATA));
                        devInfoData.cbSize = sizeof(SP_DEVINFO_DATA);
                        SetupDiOpenDeviceInfo(devInfo, (PCTSTR)devId.GetString(), NULL,
                                              DIOD_INHERIT_CLASSDRVS | DIOD_CANCEL_REMOVE, &devInfoData);

                        // The first child node of OpenSDA is the COM device node.
                        DEVINST portDevInst;
                        if (CM_Get_Child(&portDevInst, devInfoData.DevInst, 0) != CR_SUCCESS)
                        {
                            goto Refresh;
                        }

                        // Get COM device node's info.
                        ULONG idSize;
                        CString portDevId;
                        CM_Get_Device_ID_Size(&idSize, portDevInst, 0);
                        CM_Get_Device_ID(portDevInst, portDevId.GetBufferSetLength(idSize), idSize, 0);
                        portDevId.ReleaseBuffer();

                        SP_DEVINFO_DATA portDevInfoData;
                        ZeroMemory(&portDevInfoData, sizeof(SP_DEVINFO_DATA));
                        portDevInfoData.cbSize = sizeof(SP_DEVINFO_DATA);
                        SetupDiOpenDeviceInfo(devInfo, (PCTSTR)portDevId.GetString(), NULL,
                                              DIOD_INHERIT_CLASSDRVS | DIOD_CANCEL_REMOVE, &portDevInfoData);

                        if (portDevInfoData.ClassGuid == GUID_DEVCLASS_PORTS)
                        {
                            // Get the com port from the friendly name.
                            ULONG bufSize = 0;
                            SetupDiGetDeviceRegistryProperty(devInfo, &portDevInfoData, SPDRP_FRIENDLYNAME, NULL, NULL,
                                                             0, &bufSize);
                            BYTE *pBuffer = (BYTE *)malloc(bufSize);
                            SetupDiGetDeviceRegistryProperty(devInfo, &portDevInfoData, SPDRP_FRIENDLYNAME, NULL,
                                                             pBuffer, bufSize, &bufSize);

                            CString friendlyName = CString((LPCWSTR)pBuffer);
                            CString comPort = friendlyName.Mid(friendlyName.ReverseFind(_T('(')) + 1);
                            comPort.TrimRight(_T(')'));
                            if (pBuffer != NULL)
                            {
                                free(pBuffer);
                                pBuffer = NULL;
                            }
                            g_pHistoryData->SetCurrentDevice(g_pAllComDevices->FindSerialDevice(SerialDevice(comPort)));
                        }
                    }
                    else if (g_pHistoryData->GetCurrentDevice() >= 0)
                    {
                        g_pHistoryData->SetCurrentDevice(g_pAllComDevices->FindSerialDevice(preDev));
                    }
                Refresh:
                    if (((CButton *)GetDlgItem(IDC_RADIO_UART))->GetCheck() == BST_CHECKED)
                    {
                        RefreshComPortList();
                    }
                }
            }
#ifdef _DEBUG
            else if (pHdr->dbch_devicetype == DBT_DEVTYP_VOLUME)
            {
                AppendLog(_T("Device Change Event(") +
                          format_cstring(_T("uintmask = %#x"), ((PDEV_BROADCAST_VOLUME)pHdr)->dbcv_unitmask) + _T(")"));
            }
#endif
            break;
        }
        default:
            break;
    }

    return CDialog::OnDeviceChange(nEventType, dwData);
}
// See CKinetisFlashToolDlg.h for documentation of this method.
LRESULT CKinetisFlashToolDlg::OnUpdateLog(WPARAM wParam, LPARAM lParam)
{
    LPWSTR log = (LPWSTR)wParam;
    AppendLog(log);
    return 0;
}

// See CKinetisFlashToolDlg.h for documentation of this method.
LRESULT CKinetisFlashToolDlg::OnUpdateStatus(WPARAM wParam, LPARAM lParam)
{
    if (g_pBootloader->m_isConneted)
    {
        m_bootloaderVersion =
            format_cstring(_T("%c%d.%d.%d"), (g_pBootloader->m_targetInfo.targetVersion & 0xff000000) >> 24,
                           (g_pBootloader->m_targetInfo.targetVersion & 0x00ff0000) >> 16,
                           (g_pBootloader->m_targetInfo.targetVersion & 0x0000ff00) >> 8,
                           g_pBootloader->m_targetInfo.targetVersion & 0x000000ff);
        m_protoclVersion =
            format_cstring(_T("%c%d.%d.%d"), (g_pBootloader->m_targetInfo.procotolVersion & 0xff000000) >> 24,
                           (g_pBootloader->m_targetInfo.procotolVersion & 0x00ff0000) >> 16,
                           (g_pBootloader->m_targetInfo.procotolVersion & 0x0000ff00) >> 8,
                           g_pBootloader->m_targetInfo.procotolVersion & 0x000000ff);
        m_securityState =
            format_cstring(_T("%s"), g_pBootloader->m_targetInfo.securityState ? _T("SECURE") : _T("UNSECURE"));
        if (!g_pBootloader->m_targetInfo.flashSize)
        {
            m_flashSize = _T("-");
        }
        else
        {
            m_flashSize = format_cstring(_T("%s"), scale_bytes(g_pBootloader->m_targetInfo.flashSize));
        }

        m_ramSize = format_cstring(_T("%s"), scale_bytes(g_pBootloader->m_targetInfo.ramSize));

        m_rsvRgnFlashStart = format_cstring(_T("0x%X"), g_pBootloader->m_targetInfo.rsvRgnFlashStart);
        m_rsvRgnFlashEnd = format_cstring(_T("0x%X"), g_pBootloader->m_targetInfo.rsvRgnFlashEnd);
        m_rsvRgnRamStart = format_cstring(_T("0x%X"), g_pBootloader->m_targetInfo.rsvRgnRamStart);
        m_rsvRgnRamEnd = format_cstring(_T("0x%X"), g_pBootloader->m_targetInfo.rsvRgnRamEnd);

        AppendLog(_T("Device information is updated!"));
    }
    return 0;
}

// See CKinetisFlashToolDlg.h for documentation of this method.
LRESULT CKinetisFlashToolDlg::OnChangeConnection(WPARAM wParam, LPARAM lParam)
{
    if (g_pBootloader->m_isConneted)
    {
        AppendLog(_T("Connected to device successfully!"));
        ((CButton *)GetDlgItem(IDC_BUTTON_CNT_RESET))->SetWindowTextW(_T("Reset"));
        AppendLog(_T("Collecting device information......"));
        g_pBootloader->UpdateStatus();
    }
    else
    {
        m_bootloaderVersion.Empty();
        m_protoclVersion.Empty();
        m_securityState.Empty();
        m_flashSize.Empty();
        m_ramSize.Empty();
        m_rsvRgnFlashStart.Empty();
        m_rsvRgnFlashEnd.Empty();
        m_rsvRgnRamStart.Empty();
        m_rsvRgnRamEnd.Empty();

        AppendLog(_T("Disconnected from device!\r\n"));
        ((CButton *)GetDlgItem(IDC_BUTTON_CNT_RESET))->SetWindowTextW(_T("Connect"));
    }
    ::PostMessage(g_pMainDlg->m_updateDlg, USER_MS_CONNECTION_CHANGE, NULL, NULL);

    return 0;
}
